package lesson20.HW20XMLEmployee;

import java.util.Random;

public class PersonCreator {

    private static final String[] familyName = {"Алигьери", "Алксеев", "Андерсон", "Базаров", "Басников", "Бах", "Беккер", "Беркут",
                "Блок", "Васильев", "Вассерман", "Верба", "Горелый", "Горшенёв", "Иванов", "Кант", "Кипелов", "Князев", "Коробочка",
                "Король", "Ленон", "Лермонтов", "Линдеман", "Маврин", "Макартни", "Маяковский", "Ницше", "Онегин", "Петров",
                "Печенька", "Печорин", "Плюшкин", "Пожарский", "Путин", "Пух", "Пушной", "Романов", "Сахаров", "Селезнев", "Сидоров",
                "Собакевич", "Танкян", "Ульянов", "Фаренгейт", "Хоук", "Цой", "Цукерберг", "Чайковский", "Чацкий", "Чичиков"};

    private static final String[] givenName = {"Александр", "Андрей", "Борис", "Василий", "Владимир", "Георгий", "Григорий",
                "Даниил", "Дмитрий", "Евгений", "Елисей", "Иван", "Илья", "Кирилл", "Константин","Лев", "Леонид", "Максим",
                "Михаил", "Никита", "Руслан", "Тихон"};

    private static final String[] patronymicName = {"Александрович", "Алексеевич", "Андреевич", "Борисович", "Владимирович",
                "Георгиевич", "Кириллович", "Николаевич", "Олегович", "Петрович",
                "Романович", "Сергеевич", "Станиславович", "Тимофеевич", "Фёдорович", "Яковлевич", "Богданович", "Ярославович",
                "Родионович", "Феофанович", "Александрович", "Валерьянович", "Константинович", "Евгеньевич"};

    public String getRandFName() {
        return familyName[new Random().nextInt(familyName.length)];
    }

    public String getRandGName() {
        return givenName[new Random().nextInt(givenName.length)];
    }

    public String getRandPName() {
        return patronymicName[new Random().nextInt(patronymicName.length)];
    }

    public String getFullName() {
        return getRandFName() + " " + getRandGName() + " " + getRandPName();
    }
}
