package lesson23;

public class Lesson23LectureDatabase {
    /*
==================================================== Контейнеризация ===================================================

 == Docker - ПО для автоматизации развёртывания и управления приложениями в среде визуализации на уровне ОС.
    Он позволяет упаковывать приложения со всем его окружением и зависимостями в контейнер, который может быть перенесён
    на любую Linux-систему с поддержкой cgroups в ядре, а также предоставляет среду по управлению контейнерами.

====================================================== Базы данных =====================================================

    Реляционная (структура управления) база данных (РСУБД) - база данных, основанная на реляционной модели данных.
    В реляционных базах данных хранятся в виде таблиц, состоящих из строк и столбцов.

 == SQL - язык структурированных запросов, применяемый для создания, модификации и управления данными в реляционной БД.

    Типы команд в SQL Data:
    Data Definition Language - позволяет создавать и изменять SQL таблицы.
        DDL - create;
            - alter; - изменение таблицы
            - drop; - удаление таблицы (drop database, drop table)
            - truncate; - высвобождение таблицы, т.е. удаление всей информации из таблицы
            - rename.

        DML - select;
            - update;
            - insert;
            - delete;
            - merge;
            - lock table.

        DCL - grant;
            - revoke.

        TCL - commit;
            - rollback;
            - savepoint.
     */
}
