package lesson29;

public class Lecture29SpringShell {
    /*
    @Profile - аннотация, которая помогает определять как будет работать программа.
    Данная аннотация навешивается на класс.
    Особенности поведения для @Profile определяются в .yaml файле, где указывается какие бины и когда должны вызываться.

=================================================== SpringShell ========================================================

    SpringShell - отличный вариант консольного интерфейса.
    Для работы есть основные 4 аннотации:
        @ShellComponent - сосредотачивает в себе все команды, которые должны быть выполнены в командной строке.
        @ShellMethod - определяет метод, который будет срабатывать по вызову пользователя
        @ShellOption -
        @ShellMethodAvailability -

==== DAO
    Data Access Object - обычно представляется интерфейсом и является промежуточной "прослойкой" между бизнессом/клиентом и
    БД.
     */
}
